[Killed] StringLiteral
main/pages/Books/BookCreatePage.js:12:21
 
     const onSubmit = async (book) => {
         const createdBook = bookUtils.add(book);
-        console.log("createdBook: " + JSON.stringify(createdBook));
+        console.log("" + JSON.stringify(createdBook));
         navigate("/books/list");
     }
killedBy: BookCreatePage tests redirects to /books/list on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "createdBook: {\"book\":{\"id\":3,\"title\":\"The Great Gatsby\",\"author\":\"F. Scott Fitzgerald\",\"description\":\"A story about a mysterious, rich man\"}"
Received string:    "{\"book\":{\"id\":3,\"title\":\"The Great Gatsby\",\"author\":\"F. Scott Fitzgerald\",\"description\":\"A story about a mysterious, rich man\"}}"
