[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:83:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="IceCreamShops" id="appnavbar-icecreamshops-dropdown" data-testid="appnavbar-icecreamshops-dropdown" >
-                    <NavDropdown.Item href="/icecreamshops/list" data-testid="appnavbar-icecreamshops-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/icecreamshops/create" data-testid="appnavbar-icecreamshops-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="IceCreamShops" id="appnavbar-icecreamshops-dropdown" data-testid="appnavbar-icecreamshops-dropdown">
+                    <NavDropdown.Item href="/icecreamshops/list" data-testid="appnavbar-icecreamshops-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/icecreamshops/create" data-testid="appnavbar-icecreamshops-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the icecreamshops menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-icecreamshops-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:83:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="IceCreamShops" id="appnavbar-icecreamshops-dropdown" data-testid="appnavbar-icecreamshops-dropdown" >
-                    <NavDropdown.Item href="/icecreamshops/list" data-testid="appnavbar-icecreamshops-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/icecreamshops/create" data-testid="appnavbar-icecreamshops-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders the icecreamshops menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-icecreamshops-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:87:23
                   <NavDropdown title="IceCreamShops" id="appnavbar-icecreamshops-dropdown" data-testid="appnavbar-icecreamshops-dropdown" >
                     <NavDropdown.Item href="/icecreamshops/list" data-testid="appnavbar-icecreamshops-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/icecreamshops/create" data-testid="appnavbar-icecreamshops-create">Create</NavDropdown.Item>
-                      )
+                      true
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the icecreamshops menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-icecreamshops-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:87:23
                   <NavDropdown title="IceCreamShops" id="appnavbar-icecreamshops-dropdown" data-testid="appnavbar-icecreamshops-dropdown" >
                     <NavDropdown.Item href="/icecreamshops/list" data-testid="appnavbar-icecreamshops-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/icecreamshops/create" data-testid="appnavbar-icecreamshops-create">Create</NavDropdown.Item>
-                      )
+                      hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/icecreamshops/create" data-testid="appnavbar-icecreamshops-create">Create</NavDropdown.Item>
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the icecreamshops menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-icecreamshops-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:98:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Books" id="appnavbar-books-dropdown" data-testid="appnavbar-books-dropdown" >
-                    <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders the books menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-books-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
