[Killed] StringLiteral
main/pages/Books/BookIndexPage.js:20:18
     const deleteCallback = async (cell) => {
         console.log(`BookIndexPage deleteCallback: ${showCell(cell)})`);
         bookUtils.del(cell.row.values.id);
-        navigate("/books/list");
+        navigate("");
     }
 
killedBy: BookIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books/list"
Received: ""

Number of calls: 1

<html>
