[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:117:23
                   <NavDropdown title="Books" id="appnavbar-books-dropdown" data-testid="appnavbar-books-dropdown" >
                     <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
-                      )
+                      hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the books menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-books-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
