[Killed] StringLiteral
main/components/Books/BookTable.js:39:23
         },
         {
             Header: 'Title',
-            accessor: 'title',
+            accessor: "",
         },
         {
killedBy: BookTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="BookTable-cell-row-0-col-title"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Books/BookTable.js:41:9
             Header: 'Title',
             accessor: 'title',
         },
-        {
-            Header: 'Author',
-            accessor: 'author',
-        },
+        {},
         {
             Header: 'Description',
killedBy: BookTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Books/BookTable.js:42:21
             accessor: 'title',
         },
         {
-            Header: 'Author',
+            Header: "",
             accessor: 'author',
         },
killedBy: BookTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Author. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Books/BookTable.js:43:23
         },
         {
             Header: 'Author',
-            accessor: 'author',
+            accessor: "",
         },
         {
killedBy: BookTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="BookTable-cell-row-0-col-author"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
