[Killed] BlockStatement
main/components/IceCreamShops/IceCreamShopTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    iceCreamShopUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function IceCreamShopTable({
killedBy: IceCreamShopTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/IceCreamShops/IceCreamShopTable.js:18:20
     iceCreamShops,
     deleteCallback = defaultDeleteCallback,
     showButtons = true,
-    testIdPrefix = "IceCreamShopTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: IceCreamShopTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="IceCreamShopTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/IceCreamShops/IceCreamShopTable.js:22:36
 
     const navigate = useNavigate();
  
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/iceCreamShops/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: IceCreamShopTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/iceCreamShops/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/IceCreamShops/IceCreamShopTable.js:27:39
         navigate(`/iceCreamShops/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/iceCreamShops/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: IceCreamShopTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/iceCreamShops/details/2"

Number of calls: 0

<html>
  <head />
