[Killed] BlockStatement
main/pages/Books/BookEditPage.js:13:40
 import AxiosMockAdapter from "axios-mock-adapter";
 
 
-export default function BookEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate();
-
-    const response = bookUtils.getById(id);
-
-    const onSubmit = async (book) => {
-        const updatedBook = bookUtils.update(book);
-        console.log("updatedBook: " + JSON.stringify(updatedBook));
-        navigate("/books/list");
-    }
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Book</h1>
-                <BookForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.book} />
-            </div>
-        </BasicLayout>
-    )
-}
+export default function BookEditPage() {}
killedBy: BookEditPage tests renders without crashing
statusReason: Error: BookEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Books/BookEditPage.js:20:38
 
     const response = bookUtils.getById(id);
 
-    const onSubmit = async (book) => {
-        const updatedBook = bookUtils.update(book);
-        console.log("updatedBook: " + JSON.stringify(updatedBook));
-        navigate("/books/list");
-    }
+    const onSubmit = async (book) => {}
 
     return (
killedBy: BookEditPage tests redirects to /books/list on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Books/BookEditPage.js:22:21
 
     const onSubmit = async (book) => {
         const updatedBook = bookUtils.update(book);
-        console.log("updatedBook: " + JSON.stringify(updatedBook));
+        console.log("" + JSON.stringify(updatedBook));
         navigate("/books/list");
     }
killedBy: BookEditPage tests redirects to /books/list on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "updatedBook: {\"book\":{\"id\":3,\"title\":\"The Amber Spyglass\",\"author\":\"Philip Pullman\",\"description\":\"The third novel in the His Dark Materials trilogy\"}"
Received string:    "{\"book\":{\"id\":3,\"title\":\"The Amber Spyglass\",\"author\":\"Philip Pullman\",\"description\":\"The third novel in the His Dark Materials tril
