[Killed] BlockStatement
main/pages/Books/BookIndexPage.js:21:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`BookIndexPage deleteCallback: ${showCell(cell)})`);
-        bookUtils.del(cell.row.values.id);
-        navigate("/books/list");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: BookIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
