[Killed] BlockStatement
main/pages/IceCreamShops/IceCreamShopCreatePage.js:6:50
 import { useNavigate } from 'react-router-dom'
 import { iceCreamShopUtils } from 'main/utils/iceCreamShopUtils';
 
-export default function IceCreamShopCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (iceCreamShop) => {
-    const createdIceCreamShop = iceCreamShopUtils.add(iceCreamShop);
-    console.log("createdIceCreamShop: " + JSON.stringify(createdIceCreamShop));
-    navigate("/iceCreamShops/list");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Ice Cream Shop</h1>
-        <IceCreamShopForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function IceCreamShopCreatePage() {}
killedBy: IceCreamShopCreatePage tests renders without crashing
statusReason: Error: IceCreamShopCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/IceCreamShops/IceCreamShopCreatePage.js:10:44
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (iceCreamShop) => {
-    const createdIceCreamShop = iceCreamShopUtils.add(iceCreamShop);
-    console.log("createdIceCreamShop: " + JSON.stringify(createdIceCreamShop));
-    navigate("/iceCreamShops/list");
-  }  
+  const onSubmit = async (iceCreamShop) => {}  
 
   return (
killedBy: IceCreamShopCreatePage tests redirects to /iceCreamShops/list on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/IceCreamShops/IceCreamShopCreatePage.js:13:14
   const onSubmit = async (iceCreamShop) => {
     const createdIceCreamShop = iceCreamShopUtils.add(iceCreamShop);
     console.log("createdIceCreamShop: " + JSON.stringify(createdIceCreamShop));
-    navigate("/iceCreamShops/list");
+    navigate("");
   }  
 
killedBy: IceCreamShopCreatePage tests redirects to /iceCreamShops/list on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/iceCreamShops/list"
Received: ""

Number of calls: 1

<html>
