[Killed] BlockStatement
main/pages/IceCreamShops/IceCreamShopDetailsPage.js:6:51
 import IceCreamShopTable from 'main/components/IceCreamShops/IceCreamShopTable';
 import { iceCreamShopUtils } from 'main/utils/iceCreamShopUtils';
 
-export default function IceCreamShopDetailsPage() {
-  let { id } = useParams();
-
-  const response = iceCreamShopUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Ice Cream Shop Details</h1>
-        <IceCreamShopTable iceCreamShops={[response.iceCreamShop]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function IceCreamShopDetailsPage() {}
killedBy: IceCreamShopDetailsPage tests renders without crashing
statusReason: Error: IceCreamShopDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/IceCreamShops/IceCreamShopDetailsPage.js:15:81
     <BasicLayout>
       <div className="pt-2">
         <h1>Ice Cream Shop Details</h1>
-        <IceCreamShopTable iceCreamShops={[response.iceCreamShop]} showButtons={false} />
+        <IceCreamShopTable iceCreamShops={[response.iceCreamShop]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: IceCreamShopDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="IceCreamShopTable-header-Delete"
  role="columnheader"
