[Killed] BlockStatement
main/pages/IceCreamShops/IceCreamShopEditPage.js:8:48
 import { useNavigate } from 'react-router-dom'
 
 
-export default function IceCreamShopEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = iceCreamShopUtils.getById(id);
-
-    const onSubmit = async (iceCreamShop) => {
-        const updatedIceCreamShop = iceCreamShopUtils.update(iceCreamShop);
-        console.log("updatedIceCreamShop: " + JSON.stringify(updatedIceCreamShop));
-        navigate("/iceCreamShops/list");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Ice Cream Shop</h1>
-                <IceCreamShopForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.iceCreamShop}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function IceCreamShopEditPage() {}
killedBy: IceCreamShopEditPage tests renders without crashing
statusReason: Error: IceCreamShopEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/IceCreamShops/IceCreamShopEditPage.js:15:46
 
     const response = iceCreamShopUtils.getById(id);
 
-    const onSubmit = async (iceCreamShop) => {
-        const updatedIceCreamShop = iceCreamShopUtils.update(iceCreamShop);
-        console.log("updatedIceCreamShop: " + JSON.stringify(updatedIceCreamShop));
-        navigate("/iceCreamShops/list");
-    }  
+    const onSubmit = async (iceCreamShop) => {}  
 
     return (
killedBy: IceCreamShopEditPage tests redirects to /iceCreamShops on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/IceCreamShops/IceCreamShopEditPage.js:18:18
     const onSubmit = async (iceCreamShop) => {
         const updatedIceCreamShop = iceCreamShopUtils.update(iceCreamShop);
         console.log("updatedIceCreamShop: " + JSON.stringify(updatedIceCreamShop));
-        navigate("/iceCreamShops/list");
+        navigate("");
     }  
 
killedBy: IceCreamShopEditPage tests redirects to /iceCreamShops on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/iceCreamShops/list"
Received: ""

Number of calls: 1

<html>
