[Killed] BlockStatement
main/pages/IceCreamShops/IceCreamShopIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`IceCreamShopIndexPage deleteCallback: ${showCell(cell)})`);
-        iceCreamShopUtils.del(cell.row.values.id);
-        navigate("/iceCreamShops/list");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: IceCreamShopIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/IceCreamShops/IceCreamShopIndexPage.js:18:21
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
     const deleteCallback = async (cell) => {
-        console.log(`IceCreamShopIndexPage deleteCallback: ${showCell(cell)})`);
+        console.log(``);
         iceCreamShopUtils.del(cell.row.values.id);
         navigate("/iceCreamShops/list");
killedBy: IceCreamShopIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "IceCreamShopIndexPage deleteCallback: {\"id\":3,\"name\":\"i.v. drip\",\"description\":\"Quaint, compact cafe serving locally roasted coffee alongside housemade baked treats & ice cream.\",\"flavor\":\"strawberry\"}"
Received string:    ""

[Killed] ObjectLiteral
main/pages/IceCreamShops/IceCreamShopIndexPage.js:26:32
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/iceCreamShops/create">
+                <Button style={{}} as={Link} to="/iceCreamShops/create">
                     Create Ice Cream Shop
                 </Button>
killedBy: IceCreamShopIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
