[Killed] BlockStatement
src/main/utils/iceCreamShopUtils.js:2:19
 // Get ice cream shops from local storage
-const get = () => {
-    const iceCreamShopValue = localStorage.getItem("iceCreamShops");
-    if (iceCreamShopValue === undefined) {
-        const iceCreamShopCollection = { nextId: 1, iceCreamShops: [] }
-        return set(iceCreamShopCollection);
-    }
-    const iceCreamShopCollection = JSON.parse(iceCreamShopValue);
-    if (iceCreamShopCollection === null) {
-        const iceCreamShopCollection = { nextId: 1, iceCreamShops: [] }
-        return set(iceCreamShopCollection);
-    }
-    return iceCreamShopCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: IceCreamShopTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'iceCreamShops')

[Killed] ConditionalExpression
src/main/utils/iceCreamShopUtils.js:4:9
 // Get ice cream shops from local storage
 const get = () => {
     const iceCreamShopValue = localStorage.getItem("iceCreamShops");
-    if (iceCreamShopValue === undefined) {
+    if (true) {
         const iceCreamShopCollection = { nextId: 1, iceCreamShops: [] }
         return set(iceCreamShopCollection);
killedBy: iceCreamShopUtils tests get When iceCreamShops is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "iceCreamShops", "{\"nextId\":1,\"iceCreamShops\":[]}"

[Killed] BlockStatement
src/main/utils/iceCreamShopUtils.js:4:42
 // Get ice cream shops from local storage
 const get = () => {
     const iceCreamShopValue = localStorage.getItem("iceCreamShops");
-    if (iceCreamShopValue === undefined) {
-        const iceCreamShopCollection = { nextId: 1, iceCreamShops: [] }
-        return set(iceCreamShopCollection);
-    }
+    if (iceCreamShopValue === undefined) {}
     const iceCreamShopCollection = JSON.parse(iceCreamShopValue);
     if (iceCreamShopCollection === null) {
killedBy: iceCreamShopUtils tests get When iceCreamShops is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ObjectLiteral
src/main/utils/iceCreamShopUtils.js:5:40
 const get = () => {
     const iceCreamShopValue = localStorage.getItem("iceCreamShops");
     if (iceCreamShopValue === undefined) {
-        const iceCreamShopCollection = { nextId: 1, iceCreamShops: [] }
+        const iceCreamShopCollection = {}
         return set(iceCreamShopCollection);
     }
killedBy: iceCreamShopUtils tests get When iceCreamShops is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "iceCreamShops": Array [],
-   "nextId": 1,

[Killed] BlockStatement
src/main/utils/iceCreamShopUtils.js:9:42
         return set(iceCreamShopCollection);
     }
     const iceCreamShopCollection = JSON.parse(iceCreamShopValue);
-    if (iceCreamShopCollection === null) {
-        const iceCreamShopCollection = { nextId: 1, iceCreamShops: [] }
-        return set(iceCreamShopCollection);
-    }
+    if (iceCreamShopCollection === null) {}
     return iceCreamShopCollection;
 };
killedBy: IceCreamShopTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of null (reading 'iceCreamShops')

[Killed] ConditionalExpression
src/main/utils/iceCreamShopUtils.js:9:9
         return set(iceCreamShopCollection);
     }
     const iceCreamShopCollection = JSON.parse(iceCreamShopValue);
-    if (iceCreamShopCollection === null) {
+    if (false) {
         const iceCreamShopCollection = { nextId: 1, iceCreamShops: [] }
         return set(iceCreamShopCollection);
killedBy: iceCreamShopUtils tests get When iceCreamShops is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"iceCreamShops": [], "nextId": 1}
Received: null

[Killed] ObjectLiteral
src/main/utils/iceCreamShopUtils.js:10:40
     }
     const iceCreamShopCollection = JSON.parse(iceCreamShopValue);
     if (iceCreamShopCollection === null) {
-        const iceCreamShopCollection = { nextId: 1, iceCreamShops: [] }
+        const iceCreamShopCollection = {}
         return set(iceCreamShopCollection);
     }
killedBy: IceCreamShopTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'findIndex')

[Killed] BlockStatement
src/main/utils/iceCreamShopUtils.js:16:25
     return iceCreamShopCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const iceCreamShopCollection = get();
-    const iceCreamShops = iceCreamShopCollection.iceCreamShops;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = iceCreamShops.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `iceCreamShop with id ${id} not found` };
-    }
-    return { iceCreamShop: iceCreamShops[index] };
-}
+const getById = (id) => {}
 
 // set iceCreamShops in local storage
killedBy: iceCreamShopUtils tests getById Check that getting an iceCreamShop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"iceCreamShop": {"description": "Quaint, compact cafe serving locally roasted coffee alongside housemade baked treats & ice cream.", "flavor": "strawberry", "id": 3, "name": "i.v. drip"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/iceCreamShopUtils.js:24:50
     const iceCreamShops = iceCreamShopCollection.iceCreamShops;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = iceCreamShops.findIndex((r) => r.id == id);
+    const index = iceCreamShops.findIndex((r) => false);
     if (index === -1) {
         return { "error": `iceCreamShop with id ${id} not found` };
killedBy: iceCreamShopUtils tests getById Check that getting an iceCreamShop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "iceCreamShop": Object {
-     "description": "Quaint, compact cafe serving locally roasted coffee alongside housemade baked treats & ice cream.",

[Killed] ArrowFunction
src/main/utils/iceCreamShopUtils.js:24:43
     const iceCreamShops = iceCreamShopCollection.iceCreamShops;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = iceCreamShops.findIndex((r) => r.id == id);
+    const index = iceCreamShops.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `iceCreamShop with id ${id} not found` };
killedBy: iceCreamShopUtils tests getById Check that getting an iceCreamShop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "iceCreamShop": Object {
-     "description": "Quaint, compact cafe serving locally roasted coffee alongside housemade baked treats & ice cream.",

[Killed] ConditionalExpression
src/main/utils/iceCreamShopUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = iceCreamShops.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `iceCreamShop with id ${id} not found` };
     }
killedBy: iceCreamShopUtils tests getById Check that getting a non-existing iceCreamShop returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "iceCreamShop with id 99 not found",
+   "iceCreamShop": undefined,

[Killed] EqualityOperator
src/main/utils/iceCreamShopUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = iceCreamShops.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `iceCreamShop with id ${id} not found` };
     }
killedBy: iceCreamShopUtils tests getById Check that getting an iceCreamShop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "iceCreamShop": Object {
-     "description": "Quaint, compact cafe serving locally roasted coffee alongside housemade baked treats & ice cream.",

[Killed] StringLiteral
src/main/utils/iceCreamShopUtils.js:26:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = iceCreamShops.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `iceCreamShop with id ${id} not found` };
+        return { "error": `` };
     }
     return { iceCreamShop: iceCreamShops[index] };
killedBy: iceCreamShopUtils tests getById Check that getting a non-existing iceCreamShop returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "iceCreamShop with id 99 not found",
+   "error": "",

[Killed] BlockStatement
src/main/utils/iceCreamShopUtils.js:32:41
 }
 
 // set iceCreamShops in local storage
-const set = (iceCreamShopCollection) => {
-    localStorage.setItem("iceCreamShops", JSON.stringify(iceCreamShopCollection));
-    return iceCreamShopCollection;
-};
+const set = (iceCreamShopCollection) => {};
 
 // add an iceCreamShop to local storage
killedBy: iceCreamShopUtils tests get When iceCreamShops is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"iceCreamShops": [], "nextId": 1}
Received: undefined

[Killed] StringLiteral
src/main/utils/iceCreamShopUtils.js:33:26
 
 // set iceCreamShops in local storage
 const set = (iceCreamShopCollection) => {
-    localStorage.setItem("iceCreamShops", JSON.stringify(iceCreamShopCollection));
+    localStorage.setItem("", JSON.stringify(iceCreamShopCollection));
     return iceCreamShopCollection;
 };
killedBy: iceCreamShopUtils tests get When iceCreamShops is undefined in local storage, should set to empty list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "iceCreamShops", "{\"nextId\":1,\"iceCreamShops\":[]}"
Received: "", "{\"nextId\":1,\"iceCreamShops\":[]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/iceCreamShopUtils.js:38:31
 };
 
 // add an iceCreamShop to local storage
-const add = (iceCreamShop) => {
-    const iceCreamShopCollection = get();
-    iceCreamShop = { ...iceCreamShop, id: iceCreamShopCollection.nextId };
-    iceCreamShopCollection.nextId++;
-    iceCreamShopCollection.iceCreamShops.push(iceCreamShop);
-    set(iceCreamShopCollection);
-    return iceCreamShop;
-};
+const add = (iceCreamShop) => {};
 
 // update an iceCreamShop in local storage
killedBy: iceCreamShopUtils tests add Starting from [], check that adding one iceCreamShop works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"description": "Longtime establishment crafting sustainable ice creams in a variety of classic & creative flavors.", "flavor": "coffee", "id": 1, "name": "McConnell's Fine Ice Creams"}
Received: undefined

[Killed] UpdateOperator
src/main/utils/iceCreamShopUtils.js:41:5
 const add = (iceCreamShop) => {
     const iceCreamShopCollection = get();
     iceCreamShop = { ...iceCreamShop, id: iceCreamShopCollection.nextId };
-    iceCreamShopCollection.nextId++;
+    iceCreamShopCollection.nextId--;
     iceCreamShopCollection.iceCreamShops.push(iceCreamShop);
     set(iceCreamShopCollection);
killedBy: iceCreamShopUtils tests add Starting from [], check that adding one iceCreamShop works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "iceCreamShops", "{\"nextId\":2,\"iceCreamShops\":[{\"id\":1,\"name\":\"McConnell's Fine Ice Creams\",\"description\":\"Longtime establishment crafting sustainable ice creams in a variety of classic & creative flavors.\",\"flavor\":\"coffee\"}]}"
Received: "iceCreamShops", "{\"nextId\":0,\"iceCreamShops\":[{\"id\":1,\"name\":\"M

[Killed] BlockStatement
src/main/utils/iceCreamShopUtils.js:48:34
 };
 
 // update an iceCreamShop in local storage
-const update = (iceCreamShop) => {
-    const iceCreamShopCollection = get();
-
-    const iceCreamShops = iceCreamShopCollection.iceCreamShops;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = iceCreamShops.findIndex((r) => r.id == iceCreamShop.id);
-    if (index === -1) {
-        return { "error": `iceCreamShop with id ${iceCreamShop.id} not found` };
-    }
-    iceCreamShops[index] = iceCreamShop;
-    set(iceCreamShopCollection);
-    return { iceCreamShopCollection: iceCreamShopCollection };
-};
+const update = (iceCreamShop) => {};
 
 // delete an iceCreamShop from local storage
killedBy: iceCreamShopUtils tests update Check that updating an existing iceCreamShop works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] EqualityOperator
src/main/utils/iceCreamShopUtils.js:54:50
     const iceCreamShops = iceCreamShopCollection.iceCreamShops;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = iceCreamShops.findIndex((r) => r.id == iceCreamShop.id);
+    const index = iceCreamShops.findIndex((r) => r.id != iceCreamShop.id);
     if (index === -1) {
         return { "error": `iceCreamShop with id ${iceCreamShop.id} not found` };
killedBy: iceCreamShopUtils tests update Check that updating an existing iceCreamShop works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -3,17 +3,17 @@
      "iceCreamShops": Array [
        Object {

[Killed] ConditionalExpression
src/main/utils/iceCreamShopUtils.js:54:50
     const iceCreamShops = iceCreamShopCollection.iceCreamShops;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = iceCreamShops.findIndex((r) => r.id == iceCreamShop.id);
+    const index = iceCreamShops.findIndex((r) => true);
     if (index === -1) {
         return { "error": `iceCreamShop with id ${iceCreamShop.id} not found` };
killedBy: iceCreamShopUtils tests update Check that updating an non-existing iceCreamShop returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 22

  Object {
-   "error": "iceCreamShop with id 99 not found",
+   "iceCreamShopCollection": Object {

[Killed] ConditionalExpression
src/main/utils/iceCreamShopUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = iceCreamShops.findIndex((r) => r.id == iceCreamShop.id);
-    if (index === -1) {
+    if (true) {
         return { "error": `iceCreamShop with id ${iceCreamShop.id} not found` };
     }
killedBy: iceCreamShopUtils tests update Check that updating an existing iceCreamShop works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "iceCreamShopCollection": Object {
-     "iceCreamShops": Array [

[Killed] EqualityOperator
src/main/utils/iceCreamShopUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = iceCreamShops.findIndex((r) => r.id == iceCreamShop.id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `iceCreamShop with id ${iceCreamShop.id} not found` };
     }
killedBy: iceCreamShopUtils tests update Check that updating an existing iceCreamShop works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "iceCreamShopCollection": Object {
-     "iceCreamShops": Array [

[Killed] StringLiteral
src/main/utils/iceCreamShopUtils.js:56:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = iceCreamShops.findIndex((r) => r.id == iceCreamShop.id);
     if (index === -1) {
-        return { "error": `iceCreamShop with id ${iceCreamShop.id} not found` };
+        return { "error": `` };
     }
     iceCreamShops[index] = iceCreamShop;
killedBy: iceCreamShopUtils tests update Check that updating an non-existing iceCreamShop returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "iceCreamShop with id 99 not found",
+   "error": "",

[Killed] ObjectLiteral
src/main/utils/iceCreamShopUtils.js:60:12
     }
     iceCreamShops[index] = iceCreamShop;
     set(iceCreamShopCollection);
-    return { iceCreamShopCollection: iceCreamShopCollection };
+    return {};
 };
 
killedBy: iceCreamShopUtils tests update Check that updating an existing iceCreamShop works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

- Object {
-   "iceCreamShopCollection": Object {
-     "iceCreamShops": Array [

[Killed] BlockStatement
src/main/utils/iceCreamShopUtils.js:64:21
 };
 
 // delete an iceCreamShop from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const iceCreamShopCollection = get();
-    const iceCreamShops = iceCreamShopCollection.iceCreamShops;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = iceCreamShops.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `iceCreamShop with id ${id} not found` };
-    }
-    iceCreamShops.splice(index, 1);
-    set(iceCreamShopCollection);
-    return { iceCreamShopCollection: iceCreamShopCollection };
-};
+const del = (id) => {};
 
 const iceCreamShopUtils = {
killedBy: iceCreamShopUtils tests del Check that deleting an iceCreamShop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/main/utils/iceCreamShopUtils.js:72:50
     const iceCreamShops = iceCreamShopCollection.iceCreamShops;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = iceCreamShops.findIndex((r) => r.id == id);
+    const index = iceCreamShops.findIndex((r) => true);
     if (index === -1) {
         return { "error": `iceCreamShop with id ${id} not found` };
killedBy: iceCreamShopUtils tests del Check that deleting an iceCreamShop by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,13 +1,13 @@
  Object {
    "iceCreamShopCollection": Object {

[Killed] BlockStatement
src/main/utils/iceCreamShopUtils.js:73:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = iceCreamShops.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `iceCreamShop with id ${id} not found` };
-    }
+    if (index === -1) {}
     iceCreamShops.splice(index, 1);
     set(iceCreamShopCollection);
killedBy: iceCreamShopUtils tests del Check that deleting a non-existing iceCreamShop returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 17

  Object {
-   "error": "iceCreamShop with id 99 not found",
+   "iceCreamShopCollection": Object {

[Killed] ObjectLiteral
src/main/utils/iceCreamShopUtils.js:74:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = iceCreamShops.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `iceCreamShop with id ${id} not found` };
+        return {};
     }
     iceCreamShops.splice(index, 1);
killedBy: iceCreamShopUtils tests del Check that deleting a non-existing iceCreamShop returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "iceCreamShop with id 99 not found",
- }
