[Killed] BooleanLiteral
main/components/Books/BookTable.js:8:72
 import { useNavigate } from "react-router-dom";
 import { hasRole } from "main/utils/currentUser";
 
-export default function BooksTable({ books, currentUser, showButtons = true }) {
+export default function BooksTable({ books, currentUser, showButtons = false }) {
     const navigate = useNavigate();
 
killedBy: BooksIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="BookTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Books/BookTable.js:11:36
 export default function BooksTable({ books, currentUser, showButtons = true }) {
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/books/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Books/BookTable.js:15:39
         navigate(`/books/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        navigate(`/books/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Details button navigates to the details page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books/details/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Books/BookTable.js:16:18
     }
 
     const detailsCallback = (cell) => {
-        navigate(`/books/details/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests Details button navigates to the details page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books/details/2"
Received: ""

Number of calls: 1

<html>
