[Killed] BooleanLiteral
main/components/IceCreamShops/IceCreamShopTable.js:8:87
 import { cellToAxiosParamsDelete, onDeleteSuccess } from "main/utils/iceCreamShopUtils";
 import { hasRole } from "main/utils/currentUser";
 
-export default function IceCreamShopTable({ iceCreamShops, currentUser, showButtons = true }) {
+export default function IceCreamShopTable({ iceCreamShops, currentUser, showButtons = false }) {
     const navigate = useNavigate();
 
killedBy: IceCreamShopIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="IceCreamShopTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/IceCreamShops/IceCreamShopTable.js:11:36
 export default function IceCreamShopTable({ iceCreamShops, currentUser, showButtons = true }) {
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/icecreamshops/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: IceCreamShopTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/icecreamshops/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/IceCreamShops/IceCreamShopTable.js:15:39
         navigate(`/icecreamshops/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        navigate(`/icecreamshops/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: IceCreamShopTable tests Details button navigates to the details page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/icecreamshops/details/2"

Number of calls: 0

<html>
  <head />
