[Killed] BooleanLiteral
main/components/Restaurants/RestaurantTable.js:9:78
 import { hasRole } from "main/utils/currentUser";
 
 
-export default function BooksTable({ restaurants, currentUser, showButtons = true }) {
+export default function BooksTable({ restaurants, currentUser, showButtons = false }) {
 
     const navigate = useNavigate();
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:17:39
         navigate(`/restaurants/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        navigate(`/restaurants/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Details button navigates to the details page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/details/2"

Number of calls: 0

<html>
  <head />
