[Killed] ArrowFunction
main/pages/Books/BookCreatePage.js:9:33
 
 export default function BooksCreatePage() {
 
-    const objectToAxiosParams = (book) => ({
-        url: "/api/books/post",
-        method: "POST",
-        params: {
-            title: book.title,
-            author: book.author,
-            description: book.description
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (book) => {
killedBy: BooksCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:19:33
         }
     });
 
-    const onSuccess = (book) => {
-        toast(`New book Created - id: ${book.id} title: ${book.title}`);
-    }
+    const onSuccess = (book) => {}
 
     const mutation = useBackendMutation(
killedBy: BooksCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New book Created - id: 17 title: The Great Gatsby"

Number of calls: 0
