[Killed] ObjectLiteral
main/pages/Books/BookDetailsPage.js:17:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/books`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: BookDetailsPage tests loads the correct fields, and no buttons
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] BooleanLiteral
main/pages/Books/BookDetailsPage.js:27:80
     <BasicLayout>
       <div className="pt-2">
         <h1>Book Details</h1>
-        <BookTable books={[book || {}]} currentUser={currentUser} showButtons={false} />
+        <BookTable books={[book || {}]} currentUser={currentUser} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: BookDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="BookTable-header-Delete"
  role="columnheader"

[Killed] LogicalOperator
main/pages/Books/BookDetailsPage.js:27:28
     <BasicLayout>
       <div className="pt-2">
         <h1>Book Details</h1>
-        <BookTable books={[book || {}]} currentUser={currentUser} showButtons={false} />
+        <BookTable books={[book && {}]} currentUser={currentUser} showButtons={false} />
       </div>
     </BasicLayout>
killedBy: BookDetailsPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')
