[Killed] ObjectLiteral
main/pages/Books/BookEditPage.js:16:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/books?id=${id}`],
-            {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/books`,
-                params: {
-                    id
-                }
-            }
+            {}
         );
 
killedBy: BooksEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="BookForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Books/BookEditPage.js:26:36
         );
 
 
-    const objectToAxiosPutParams = (book) => ({
-        url: "/api/books",
-        method: "PUT",
-        params: {
-            id: book.id,
-        },
-        data: {
-            title: book.title,
-            author: book.author,
-            description: book.description
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (book) => {
killedBy: BooksEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book Updated - id: 17 title: Lord of the Flies"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/Books/BookEditPage.js:39:33
         }
     });
 
-    const onSuccess = (book) => {
-        toast(`Book Updated - id: ${book.id} title: ${book.title}`);
-    }
+    const onSuccess = (book) => {}
 
     const mutation = useBackendMutation(
killedBy: BooksEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book Updated - id: 17 title: Lord of the Flies"

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Books/BookEditPage.js:64:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Book</h1>
-                {book &&
-                    <BookForm initialBook={book} submitAction={onSubmit} buttonLabel="Update" />
+                {false
                 }
             </div>
killedBy: BooksEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="BookForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Books/BookEditPage.js:64:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Book</h1>
-                {book &&
-                    <BookForm initialBook={book} submitAction={onSubmit} buttonLabel="Update" />
+                {true
                 }
             </div>
killedBy: BooksEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="BookForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
