[Killed] BlockStatement
main/pages/Books/BookIndexPage.js:8:42
 import BookTable from 'main/components/Books/BookTable';
 import { useCurrentUser } from 'main/utils/currentUser'
 
-export default function BooksIndexPage() {
-
-    const currentUser = useCurrentUser();
-  
-    const { data: books, error: _error, status: _status } =
-      useBackend(
-        // Stryker disable next-line all : don't test internal caching of React Query
-        ["/api/books/all"],
-        { method: "GET", url: "/api/books/all" },
-        []
-      );
-  
-    return (
-      <BasicLayout>
-        <div className="pt-2">
-          <h1>Books</h1>
-          <BookTable books={books} currentUser={currentUser} />
-        </div>
-      </BasicLayout>
-    )
-  }
+export default function BooksIndexPage() {}
killedBy: BooksIndexPage tests renders without crashing for regular user
statusReason: Error: BooksIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/Books/BookIndexPage.js:16:31
       useBackend(
         // Stryker disable next-line all : don't test internal caching of React Query
         ["/api/books/all"],
-        { method: "GET", url: "/api/books/all" },
+        { method: "GET", url: "" },
         []
       );
killedBy: BooksIndexPage tests renders three dates without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="BookTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
