[Killed] ArrowFunction
main/pages/IceCreamShops/IceCreamShopCreatePage.js:9:31
 
 export default function IceCreamShopCreatePage() {
 
-  const objectToAxiosParams = (iceCreamShop) => ({
-    url: "/api/icecreamshop/post",
-    method: "POST",
-    params: {
-      name: iceCreamShop.name,
-      description: iceCreamShop.description,
-      flavor: iceCreamShop.flavor
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (iceCreamShop) => {
killedBy: IceCreamShopCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/IceCreamShops/IceCreamShopCreatePage.js:9:50
 
 export default function IceCreamShopCreatePage() {
 
-  const objectToAxiosParams = (iceCreamShop) => ({
-    url: "/api/icecreamshop/post",
-    method: "POST",
-    params: {
-      name: iceCreamShop.name,
-      description: iceCreamShop.description,
-      flavor: iceCreamShop.flavor
-    }
-  });
+  const objectToAxiosParams = (iceCreamShop) => ({});
 
   const onSuccess = (iceCreamShop) => {
killedBy: IceCreamShopCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/IceCreamShops/IceCreamShopCreatePage.js:11:13
 
   const objectToAxiosParams = (iceCreamShop) => ({
     url: "/api/icecreamshop/post",
-    method: "POST",
+    method: "",
     params: {
       name: iceCreamShop.name,
killedBy: IceCreamShopCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/IceCreamShops/IceCreamShopCreatePage.js:19:39
     }
   });
 
-  const onSuccess = (iceCreamShop) => {
-    toast(`New iceCreamShop Created - name: ${iceCreamShop.name}, description: ${iceCreamShop.description}, flavor: ${iceCreamShop.flavor}`);
-  }
+  const onSuccess = (iceCreamShop) => {}
 
   const mutation = useBackendMutation(
killedBy: IceCreamShopCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New iceCreamShop Created - name: Baskin Robbins, description: A lot of ice cream, flavor: Vanilla"

Number of calls: 0

[Killed] StringLiteral
main/pages/IceCreamShops/IceCreamShopCreatePage.js:20:11
   });
 
   const onSuccess = (iceCreamShop) => {
-    toast(`New iceCreamShop Created - name: ${iceCreamShop.name}, description: ${iceCreamShop.description}, flavor: ${iceCreamShop.flavor}`);
+    toast(``);
   }
 
killedBy: IceCreamShopCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New iceCreamShop Created - name: Baskin Robbins, description: A lot of ice cream, flavor: Vanilla"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/IceCreamShops/IceCreamShopCreatePage.js:36:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    return <Navigate to="/icecreamshops/list" />
-  }
+  if (isSuccess) {}
 
   return (
killedBy: IceCreamShopCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/icecreamshops/list"}

Number of calls: 0
