[Killed] ObjectLiteral
main/pages/IceCreamShops/IceCreamShopDetailsPage.js:14:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/icecreamshop?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/icecreamshop`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: IceCreamShopDetailsPage tests renders without crashing
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/icecreamshop"
Received string:    "Error communicating with backend via undefined on undefined"

[Killed] ConditionalExpression
main/pages/IceCreamShops/IceCreamShopDetailsPage.js:27:44
     <BasicLayout>
       <div className="pt-2">
         <h1>Ice Cream Shop Details</h1>
-        <IceCreamShopTable iceCreamShops={[icecreamshop || {}]} currentUser={currentUser} showButtons={false} />
+        <IceCreamShopTable iceCreamShops={[true]} currentUser={currentUser} showButtons={false} />
       </div>
     </BasicLayout>
killedBy: IceCreamShopDetailsPage tests loads the correct fields, and no buttons
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] ConditionalExpression
main/pages/IceCreamShops/IceCreamShopDetailsPage.js:27:44
     <BasicLayout>
       <div className="pt-2">
         <h1>Ice Cream Shop Details</h1>
-        <IceCreamShopTable iceCreamShops={[icecreamshop || {}]} currentUser={currentUser} showButtons={false} />
+        <IceCreamShopTable iceCreamShops={[false]} currentUser={currentUser} showButtons={false} />
       </div>
     </BasicLayout>
killedBy: IceCreamShopDetailsPage tests loads the correct fields, and no buttons
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
