[Killed] ArrowFunction
main/pages/IceCreamShops/IceCreamShopEditPage.js:26:36
         );
 
 
-    const objectToAxiosPutParams = (iceCreamShop) => ({
-        url: "/api/icecreamshop",
-        method: "PUT",
-        params: {
-            id: iceCreamShop.id,
-        },
-        data: {
-            name: iceCreamShop.name,
-            description: iceCreamShop.description,
-            flavor: iceCreamShop.flavor
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (iceCreamShop) => {
killedBy: IceCreamShopEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "IceCreamShop Updated - id: 17, name: Coldstone Creamery, description: The one with the cold stone, flavor: Chocolate"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/IceCreamShops/IceCreamShopEditPage.js:32:15
         params: {
             id: iceCreamShop.id,
         },
-        data: {
-            name: iceCreamShop.name,
-            description: iceCreamShop.description,
-            flavor: iceCreamShop.flavor
-        }
+        data: {}
     });
 
killedBy: IceCreamShopEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"name\":\"Coldstone Creamery\",\"description\":\"The one with the cold stone\",\"flavor\":\"Chocolate\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/IceCreamShops/IceCreamShopEditPage.js:39:41
         }
     });
 
-    const onSuccess = (iceCreamShop) => {
-        toast(`IceCreamShop Updated - id: ${iceCreamShop.id}, name: ${iceCreamShop.name}, description: ${iceCreamShop.description}, flavor: ${iceCreamShop.flavor}`);
-    }
+    const onSuccess = (iceCreamShop) => {}
 
     const mutation = useBackendMutation(
killedBy: IceCreamShopEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "IceCreamShop Updated - id: 17, name: Coldstone Creamery, description: The one with the cold stone, flavor: Chocolate"

Number of calls: 0

[Killed] ConditionalExpression
main/pages/IceCreamShops/IceCreamShopEditPage.js:65:21
             <div className="pt-2">
                 <h1>Edit Ice Cream Shop</h1>
                 {
-                    iceCreamShop && <IceCreamShopForm initialContents={iceCreamShop} submitAction={onSubmit} buttonLabel="Update" />
+                    true
                 }
                 
killedBy: IceCreamShopEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="IceCreamShopForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/IceCreamShops/IceCreamShopEditPage.js:65:21
             <div className="pt-2">
                 <h1>Edit Ice Cream Shop</h1>
                 {
-                    iceCreamShop && <IceCreamShopForm initialContents={iceCreamShop} submitAction={onSubmit} buttonLabel="Update" />
+                    false
                 }
                 
killedBy: IceCreamShopEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="IceCreamShopForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
