[Killed] BlockStatement
main/pages/IceCreamShops/IceCreamShopIndexPage.js:9:49
 import { useCurrentUser } from 'main/utils/currentUser'
 
 
-export default function IceCreamShopIndexPage() {
-
-    const currentUser = useCurrentUser();
-  
-    const { data: icecreamshops, error: _error, status: _status } =
-      useBackend(
-        // Stryker disable next-line all : don't test internal caching of React Query
-        ["/api/icecreamshop/all"],
-        { method: "GET", url: "/api/icecreamshop/all" },
-        []
-      );
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Ice Cream Shops</h1>
-                <IceCreamShopTable iceCreamShops={icecreamshops} currentUser={currentUser} />
-            </div>
-        </BasicLayout>
-    )
-}
+export default function IceCreamShopIndexPage() {}
killedBy: IceCreamShopIndexPage tests renders without crashing for regular user
statusReason: Error: IceCreamShopIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/IceCreamShops/IceCreamShopIndexPage.js:17:19
       useBackend(
         // Stryker disable next-line all : don't test internal caching of React Query
         ["/api/icecreamshop/all"],
-        { method: "GET", url: "/api/icecreamshop/all" },
+        { method: "", url: "/api/icecreamshop/all" },
         []
       );
killedBy: IceCreamShopIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/icecreamshop/all"
Received string:    "Error communicating with backend via  on /api/icecreamshop/all"

[Killed] ArrayDeclaration
main/pages/IceCreamShops/IceCreamShopIndexPage.js:18:9
         // Stryker disable next-line all : don't test internal caching of React Query
         ["/api/icecreamshop/all"],
         { method: "GET", url: "/api/icecreamshop/all" },
-        []
+        ["Stryker was here"]
       );
 
killedBy: IceCreamShopIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="IceCreamShopTable-cell-row-0-col-id" role="cell" /> instead
