[Killed] ArrowFunction
main/pages/Restaurants/RestaurantCreatePage.js:9:31
 
 export default function RestaurantCreatePage() {
 
-  const objectToAxiosParams = (restaurant) => ({
-    url: "/api/restaurants/post",
-    method: "POST",
-    params: {
-        name: restaurant.name,
-        description: restaurant.description,
-        address: restaurant.address
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
