[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantDetailsPage.js:15:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/restaurants?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/restaurants`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: RestaurantDetailsPage tests renders without crashing
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/restaurants"
Received string:    "Error communicating with backend via undefined on undefined"

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantDetailsPage.js:28:40
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        <RestaurantTable restaurants={[restaurant || {}]} currentUser={currentUser} showButtons={false} />
+        <RestaurantTable restaurants={[false]} currentUser={currentUser} showButtons={false} />
       </div>
     </BasicLayout>
killedBy: RestaurantDetailsPage tests loads the correct fields, and no buttons
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] BooleanLiteral
main/pages/Restaurants/RestaurantDetailsPage.js:28:98
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        <RestaurantTable restaurants={[restaurant || {}]} currentUser={currentUser} showButtons={false} />
+        <RestaurantTable restaurants={[restaurant || {}]} currentUser={currentUser} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: RestaurantDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="RestaurantTable-header-Delete"
  role="columnheader"
