[Killed] ArrowFunction
main/pages/Restaurants/RestaurantEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (restaurant) => ({
-        url: "/api/restaurants",
-        method: "PUT",
-        params: {
-            id: restaurant.id,
-        },
-        data: {
-            name: restaurant.name,
-            description: restaurant.description,
-            address: restaurant.address
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 3 name: South Coast Deli (Goleta)"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:24:53
             }
         );
 
-    const objectToAxiosPutParams = (restaurant) => ({
-        url: "/api/restaurants",
-        method: "PUT",
-        params: {
-            id: restaurant.id,
-        },
-        data: {
-            name: restaurant.name,
-            description: restaurant.description,
-            address: restaurant.address
-        }
-    });
+    const objectToAxiosPutParams = (restaurant) => ({});
 
     const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 3 name: South Coast Deli (Goleta)"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
