[Killed] ObjectLiteral
src/main/utils/bookUtils.js:10:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/books",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return {}
 }
killedBy: BooksIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/bookUtils.js:11:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/books",
+        url: "",
         method: "DELETE",
         params: {
killedBy: BooksIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/bookUtils.js:12:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/books",
-        method: "DELETE",
+        method: "",
         params: {
             id: cell.row.values.id
killedBy: BooksIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
