[Killed] BlockStatement
src/main/utils/iceCreamShopUtils.js:9:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/icecreamshop",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
killedBy: IceCreamShopIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "IceCreamShop with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
